Revit 2027 API
EnergyAnalysisConstruction.GetMaterialIds Method
 Returns a list of ids of the associated materials to analytical construction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetMaterialIds()
Public Function GetMaterialIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetMaterialIds()
member GetMaterialIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
See Also
Reference
EnergyAnalysisConstruction Class
GetMaterialIds Overload
Autodesk.Revit.DB.Analysis Namespace